In [18]:
import pandas as pd
import numpy as np

In [19]:
# Create Data
stuff = {'Corporations':['Apple','Google','Meta','Apple','Google','Meta']
         ,'Employees':['Marie','Zagreus','Melissa','Fedosev','Saun','Jokeph']
         ,'Salary':[200,220,190,130,120,150]}
# Create Dataframe
my_df = pd.DataFrame(stuff)
my_df

  Corporations Employees  Salary
0        Apple     Marie     200
1       Google   Zagreus     220
2         Meta   Melissa     190
3        Apple   Fedosev     130
4       Google      Saun     120
5         Meta    Jokeph     150

In [20]:
# Group by Corporation - To get object location in memory
company = my_df.groupby('Corporations')
company

In [21]:
# Sum
company.sum('Salary')

              Salary
Corporations
Apple            330
Google           340
Meta             340

In [22]:
# Mean
company.mean('Salary')

              Salary
Corporations
Apple          165.0
Google         170.0
Meta           170.0

In [23]:
# Max min
company.max('Salary')

              Salary
Corporations
Apple            200
Google           220
Meta             190

In [27]:
# Count
company.count()

              Employees  Salary
Corporations
Apple                 2       2
Google                2       2
Meta                  2       2

In [28]:
# describe
company.describe()

             Salary
              count   mean        std    min    25%    50%    75%    max
Corporations
Apple           2.0  165.0  49.497475  130.0  147.5  165.0  182.5  200.0
Google          2.0  170.0  70.710678  120.0  145.0  170.0  195.0  220.0
Meta            2.0  170.0  28.284271  150.0  160.0  170.0  180.0  190.0